---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceIntegralError
source: html/058ceb53-9181-2842-96ce-c192f4661c24.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceIntegralError Property

Could not create integral wall sweep for wall instance. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateCorniceIntegralError { get; }
```